/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   validate_collectibles_exist.c                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: urassh <urassh@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/09/11 20:52:00 by urassh            #+#    #+#             */
/*   Updated: 2025/09/11 20:52:00 by urassh           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "map_rule.h"

// 5. Collectibleの数が1以上である事
// マップ内にコレクタブル（'C'）が1つ以上存在することを確認
int	validate_map_collectibles_exist(t_map *map)
{
	// 実装は後で行う
	(void)map;
	return (OK);
}
