/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   validate_clearable.c                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: urassh <urassh@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/09/11 20:52:00 by urassh            #+#    #+#             */
/*   Updated: 2025/09/11 20:52:00 by urassh           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "map_rule.h"

// 6. 必ず、クリア可能である事
// プレイヤーから全てのコレクタブルへの経路が存在することを確認
// プレイヤーから出口への経路が存在することを確認
int	validate_map_clearable(t_map *map)
{
	// 実装は後で行う
	(void)map;
	return (OK);
}
